public class homeTask01 {
    // Примитивные типы данных. Created: 12.08.2020 10:01
/*
целочисленные
byte	8 бит	от -128 до 127
short	16 бит	от -32768 до 32767
char	16 бит	беззнаковое целое число, представляющее собой символ UTF-16 (буквы и цифры)
int	32 бит	от -2147483648 до 2147483647
long	64 бит	от -9223372036854775808L до 9223372036854775807L

с плавающей точкой
float	32	от 1.4e-45f до 3.4e+38f
double	64	от 4.9e-324 до 1.7e+308

логический тип
boolean - true , false
boolean	8 (в массивах), 32 (не в массивах используется int)	true (истина) или false (ложь)

символьный тип char
 */
}
